precursor_kOmegaFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2880
(
(0.0671069 -1.34484e-10 1.49439e-10)
(0.0671068 -7.41968e-12 -1.16335e-10)
(0.0671074 1.40751e-10 -3.28302e-11)
(0.0600023 3.47405e-09 2.56967e-11)
(0.0600021 -4.83982e-09 5.60161e-12)
(0.0600033 1.36886e-09 -3.14416e-11)
(0.071558 1.20186e-08 2.61414e-11)
(0.0715579 -1.83801e-08 1.28159e-11)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
