precursor_kOmegaFine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2880
(
4.05358e-05
4.05354e-05
4.05368e-05
5.34559e-05
5.34537e-05
5.34578e-05
7.93659e-05
7.93635e-05
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
192
(
3.42245e-05
0.000104383
0.000104383
0.000143857
0.000183077
0.000223274
0.000223274
0.000265296
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
3.42245e-05
2.1793e-05
3.69533e-05
5.47597e-05
7.54218e-05
0.000100061
0.000130146
0.000167688
...
)
;
    }
}


// ************************************************************************* //
