precursor_kOmegaFine/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
2880
(
388.612
388.615
388.612
785.822
785.827
785.822
789.097
789.102
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
192
(
424.204
7.84264
7.84264
9.20689
10.3864
11.4701
11.4701
12.503
...
)
;
    }
    noSlipWalls
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        blended         false;
        value           nonuniform List<scalar> 
90
(
424.204
843.917
843.917
843.917
843.917
843.917
843.917
843.917
...
)
;
    }
}


// ************************************************************************* //
