precursor_kOmegaFine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2880
(
3.41439e-12
3.77807e-08
1.94637e-08
5.89106e-11
3.77211e-08
1.94682e-08
-2.41313e-11
3.78933e-08
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            zeroGradient;
    }
    noSlipWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
