precursor_kOmegaFine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-1.25 -0.6 0.0)
    ( 1.25 -0.6 0.0)
    ( 1.25  0.6 0.0)
    (-1.25  0.6 0.0)
    (-1.25 -0.6 0.15)
    ( 1.25 -0.6 0.15)
    ( 1.25  0.6 0.15)
    (-1.25  0.6 0.15)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 30 32)
    simpleGrading
    (	1
	(
		(50 50 8)
		(50 50 0.125)
	)
	36
    )
);

edges
(
);

boundary
(
    freeSurface
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type cyclic;
	neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
	neighbourPatch inlet;
        faces
        (
            (2 6 5 1)
        );
    }
    sidewalls
    {
        type wall;
        faces
        (
	    (1 5 4 0)
	    (3 7 6 2)
        );
    }
    noSlipWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
